W9D2/Art Share API/app/controllers/artwork_shares_controller.rb

    def create
        # debugger
        art_share = ArtworkShare.new(share_params)
        if art_share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 25], ["created_at", "2019-07-23 21:38:34.225520"], ["updated_at", "2019-07-23 21:38:34.225520"]]

    def destroy
        art_share = ArtworkShare.find(params[:id])
        art_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]