W9D2/Art Share API/app/controllers/artworks_controller.rb

    def create
        # debugger
        art = Artwork.new(artwork_params)

        if art.save!
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "artwork3"], ["image_url", "image_url3"], ["artist_id", 25], ["created_at", "2019-07-23 21:07:20.349797"], ["updated_at", "2019-07-23 21:07:20.349797"]]

    def show
        art = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        art = Artwork.find(params[:id])
        art.update_attributes(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "artwork333333"], ["updated_at", "2019-07-23 21:07:55.167691"], ["id", 5]]