W9D2/Art Share API/app/controllers/users_controller.rb

    def create
        # debugger
        user = User.new(user_params)
        # user.save!

        if user.save!
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Endy"], ["created_at", "2019-07-23 20:42:18.633973"], ["updated_at", "2019-07-23 20:42:18.633973"]]

    def update
        user = User.find(params[:id])
        user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Trevorrrr"], ["updated_at", "2019-07-23 20:59:42.739946"], ["id", 25]]