W10D4/reddit_clone/app/controllers/posts_controller.rb

SELECT  "subs".* FROM "subs" ORDER BY "subs"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def new
    @post = Post.new
    @subs = Sub.all

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "this is post"], ["url", ""], ["content", ""], ["sub_id", 3], ["author_id", 4], ["created_at", "2019-08-01 22:50:40.637603"], ["updated_at", "2019-08-01 22:50:40.637603"]]
SELECT  "subs".* FROM "subs" ORDER BY "subs"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    # @post.sub_id = params[:post][:sub_id]
    if @post.save!
      redirect_to post_url(@post)
    else
      flash[:errors] = @post.errors.full_messages
      @subs = Sub.all