W10D4/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "tes test"], ["description", "dfgdf"], ["moderator_id", 5], ["created_at", "2019-08-01 21:38:50.784432"], ["updated_at", "2019-08-01 21:38:50.784432"]]
---
  def create
    @sub = current_user.subs.new(sub_params)
    # debugger
    # @sub.moderator_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "edited"], ["updated_at", "2019-08-01 21:47:33.156736"], ["id", 11]]
---
  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update_attributes(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 12]]
---
  def destroy
    @sub = Sub.find(params[:id])
    @sub.destroy