W9D1/first_routes_and_controllers/first_routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "school", "unit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Trevor"], ["school", "appAcademy"], ["unit", "Rails"], ["created_at", "2019-07-22 23:43:59.963008"], ["updated_at", "2019-07-22 23:43:59.963008"]]
---
    def create
        # debugger
        user = User.new(user_params)
        user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "unit" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Andy"], ["unit", "CSS"], ["updated_at", "2019-07-22 23:54:02.544615"], ["id", 2]]
---
    def update
        user = User.find(params[:id])
        user.update_attributes(user_params)